## Production: cdn
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 0 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                      NAME                                      |
|----------|--------------------------------------------------------------------------------|
| recreate | `aws_acm_certificate_validation.cdn_certificate_validation`                    |
|          | `aws_route53_record.cdn_A`                                                     |
|          | `aws_route53_record.cdn_dns_validation[&quot;*.cdn.design-system.alpha.canada.ca&quot;]` |
|          | `aws_route53_record.cdn_dns_validation[&quot;cdn.design-system.alpha.canada.ca&quot;]`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate_validation.cdn_certificate_validation must be replaced
-/+ resource "aws_acm_certificate_validation" "cdn_certificate_validation" {
      ~ id                      = "2023-05-12 18:03:49.928 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [ # forces replacement
          - "_94ea16cd767a0e285a31329fa8032262.cdn.design-system.alpha.canada.ca",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route53_record.cdn_A must be replaced
-/+ resource "aws_route53_record" "cdn_A" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "cdn.design-system.alpha.canada.ca" -> (known after apply)
      ~ id                               = "Z0187089115L834W3TQZN_cdn.design-system.alpha.canada.ca_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "cdn.design-system.alpha.canada.ca"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "Z0187089115L834W3TQZN" -> "Z001234567890ABCDEFGHIJ" # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.cdn_dns_validation["*.cdn.design-system.alpha.canada.ca"] must be replaced
-/+ resource "aws_route53_record" "cdn_dns_validation" {
      ~ fqdn                             = "_94ea16cd767a0e285a31329fa8032262.cdn.design-system.alpha.canada.ca" -> (known after apply)
      ~ id                               = "Z0187089115L834W3TQZN__94ea16cd767a0e285a31329fa8032262.cdn.design-system.alpha.canada.ca._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_94ea16cd767a0e285a31329fa8032262.cdn.design-system.alpha.canada.ca"
      ~ zone_id                          = "Z0187089115L834W3TQZN" -> "Z001234567890ABCDEFGHIJ" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.cdn_dns_validation["cdn.design-system.alpha.canada.ca"] must be replaced
-/+ resource "aws_route53_record" "cdn_dns_validation" {
      ~ fqdn                             = "_94ea16cd767a0e285a31329fa8032262.cdn.design-system.alpha.canada.ca" -> (known after apply)
      ~ id                               = "Z0187089115L834W3TQZN__94ea16cd767a0e285a31329fa8032262.cdn.design-system.alpha.canada.ca._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_94ea16cd767a0e285a31329fa8032262.cdn.design-system.alpha.canada.ca"
      ~ zone_id                          = "Z0187089115L834W3TQZN" -> "Z001234567890ABCDEFGHIJ" # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

Warning: Argument is deprecated

  with module.cdn_origin.aws_s3_bucket.this,
  on .terraform/modules/cdn_origin/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
